w4d3/99cats/app/views/cats/_req_tr.html.erb

SELECT  "cats".* FROM "cats"  WHERE "cats"."id" = $1 LIMIT 1  [["id", 7]]
SELECT  1 AS one FROM "cats"  WHERE "cats"."user_id" = $1 AND "cats"."id" = 7 LIMIT 1  [["user_id", 43]]
---
    <% if current_user %>
      <% if req.pending? && current_user.cats.include?(Cat.find_by_id(req.cat_id))%>