w4d3/99cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "created_at", "description", "name", "sex", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @cat = Cat.new(cat_params)
    @cat.user_id = current_user.id
    if @cat.save

SELECT  "cats".* FROM "cats"  WHERE "cats"."user_id" = $1 AND "cats"."id" = 1 LIMIT 1  [["user_id", 100]]
---
  def edit
    @cat = current_user.cats.find_by_id(params[:id])