w6d4/skeleton/app/controllers/follows_controller.rb

  def create
    # simulate latency
    sleep(1)

    @follow = current_user.out_follows.create!(followee_id: params[:user_id])
---
INSERT INTO "follows" ("created_at", "followee_id", "follower_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2016-08-15 23:00:05.796452"], ["followee_id", 3], ["follower_id", 9], ["updated_at", "2016-08-15 23:00:05.796452"]]

  def destroy
    # simulate latency
    sleep(1)

    @follow = current_user.out_follows.find_by(followee_id: params[:user_id])
    @follow.destroy!
---
DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 5]]